<a href="https://colab.research.google.com/github/GregoDs/DSassignment.ecommerce/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL 


*   Structured Query Language (SQL) is the language that is used to store, manipulate and retrieve data from many databases. It is the standard language for many relational database management systems which are a type of databases used by organisations across the world. These type of relational database management systems are used to store data in tables and examples of such include SQLite, MySQL, Postgres, Oracle etc

## Objectives

*    learn how tables in databases are created
*  learn how the structure of tables is defined 

 The better the structure, the easier it becomes to clean data.

In [6]:
%load_ext sql

In [7]:
%sql sqlite://

'Connected: @None'

In [ ]:
## Creating table

%%sql
CREATE TABLE IF NOT EXISTS Shop_stock (
  ItemID,
  ItemName,
  Price,
  Exp_Date,
  Stock_Available
);

SELECT * from Shop_stock;

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS Shop (ItemID,ItemName,Price,Exp_Date,Stock_Available
);

SELECT * from Shop_stock;

 * sqlite://
Done.
Done.

[]

In [ ]:
## Specifying Column Data Types

%%sql
CREATE TABLE IF NOT EXISTS Citizens (
  NationalID int,
  FirstName varchar(20),
  LastName varchar(20),
  Address varchar(100)
);

SELECT * from Citizens;

 * sqlite://
Done.
Done.

[]

In [ ]:
## int,varchar,datetime,boolean,text,float

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS Books(
  ReleaseDate date,
  Author text,
  Book_Title varchar(255),
  Caregory varchar(255),
  Rating varchar(255)
);

Select * from Books

 * sqlite://
Done.
Done.

[]

In [ ]:
# Let's create a table customer with CustID with datatype Integer, LastName 
# with datatype character(25), FirstName with datatype Character(20),Pay as type float

In [ ]:
# Create a table called employees that stores employee number, employee name, 
# department, and salary information using appropriate data types
#

In [ ]:
# create alcoholic drinks survey table
%%sql
Create table if not exists Participants(
  id int,
  ParticipantsName text,
  age int DEFAULT 18,
  Opinion text
);

 * sqlite://
Done.

[]

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS students ( 
  id varchar(20),
  StudentName varchar(20),
  Age int DEFAULT 'Unkwown'
);
Select * from students;

 * sqlite://
Done.
Done.

[]

In [ ]:
# Let's create a new table called restaurants with the fields
# - name: string
# - description: text 
# - address: string, default value is unknown
# - user_id: integer
# - last_orders_at: date

In [ ]:
# Altering SQL table

%%sql
ALTER TABLE  students ADD Gender;

Select * from students;

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql
ALTER TABLE students DROP COLUMN Age;

Select * from students;

 * sqlite://
(sqlite3.OperationalError) near "DROP": syntax error
[SQL: ALTER TABLE students DROP COLUMN Age;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%%sql
ALTER TABLE students RENAME TO School;

Select * from School;

 * sqlite://
Done.
Done.

[]

In [ ]:
# Create a table TeamMembers id,name,age (default value),gender
# add a column DOB

In [ ]:
#rename table from books to stocks
%%sql
CREATE TABLE IF NOT EXISTS Books(
  ReleaseDate date,
  Author text,
  Book_Title varchar(255),
  Caregory varchar(255),
  Rating varchar(255)
);

Select * from Books

## Selecting & Retrieving Data with Sql

In [11]:
import csv
import pandas as pd

In [13]:
with open('/content/Countries.csv','r') as Countries:
  Interpol = pd.read_csv(Countries,encoding='utf-8')

%sql DROP TABLE IF EXISTS Interpol;
%sql PERSIST Interpol;

 * sqlite://
Done.
 * sqlite://

'Persisted interpol'

In [14]:
with open('/content/WorldCup.csv','r') as WC:
  WorldCup = pd.read_csv(WC,encoding='utf-8')

%sql DROP TABLE IF EXISTS WorldCup;
%sql PERSIST WorldCup;

 * sqlite://
Done.
 * sqlite://

'Persisted worldcup'

In [15]:
%sql SELECT * from Interpol limit 5

 * sqlite://
Done.

[(0, 'Albania', 3, 3, 0, 'Europe', 'http://www.crwflags.com/fotw/images/a/al.gif'),
 (1, 'Angola', 0, 0, 1, 'Northern Africa', 'http://www.crwflags.com/fotw/images/a/ao.gif'),
 (2, 'Argentina', 2, 2, 1, 'South America', 'http://www.crwflags.com/fotw/images/a/ar.gif'),
 (3, 'Australia', 1, 1, 2, 'Oceania', 'http://www.crwflags.com/fotw/images/a/au.gif'),
 (4, 'Austria', 1, 1, 0, 'Europe', 'http://www.crwflags.com/fotw/images/a/at.gif')]

In [16]:
%sql SELECT * from WorldCup limit 5

 * sqlite://
Done.

[(0, 1930, '13 Jul 1930 - 15:00 ', 'Group 1', 'Pocitos', 'Montevideo ', 'France', 4, 1, 'Mexico', ' ', 4444.0, 3, 0, 'LOMBARDI Domingo (URU)', 'CRISTOPHE Henry (BEL)', 'REGO Gilberto (BRA)', 201, 1096, 'FRA', 'MEX'),
 (1, 1930, '13 Jul 1930 - 15:00 ', 'Group 4', 'Parque Central', 'Montevideo ', 'USA', 3, 0, 'Belgium', ' ', 18346.0, 2, 0, 'MACIAS Jose (ARG)', 'MATEUCCI Francisco (URU)', 'WARNKEN Alberto (CHI)', 201, 1090, 'USA', 'BEL'),
 (2, 1930, '14 Jul 1930 - 12:45 ', 'Group 2', 'Parque Central', 'Montevideo ', 'Yugoslavia', 2, 1, 'Brazil', ' ', 24059.0, 2, 0, 'TEJADA Anibal (URU)', 'VALLARINO Ricardo (URU)', 'BALWAY Thomas (FRA)', 201, 1093, 'YUG', 'BRA'),
 (3, 1930, '14 Jul 1930 - 14:50 ', 'Group 3', 'Pocitos', 'Montevideo ', 'Romania', 3, 1, 'Peru', ' ', 2549.0, 1, 0, 'WARNKEN Alberto (CHI)', 'LANGENUS Jean (BEL)', 'MATEUCCI Francisco (URU)', 201, 1098, 'ROU', 'PER'),
 (4, 1930, '15 Jul 1930 - 16:00 ', 'Group 1', 'Parque Central', 'Montevideo ', 'Argentina', 1, 0, 'France', ' ', 23409.0, 0, 0, 'REGO Gilberto (BRA)', 'SAUCEDO Ulises (BOL)', 'RADULESCU Constantin (ROU)', 201, 1085, 'ARG', 'FRA')]

### Selecting Single Columns

In [17]:
%%sql

Select  Region From Interpol limit 10;

 * sqlite://
Done.

[('Europe',),
 ('Northern Africa',),
 ('South America',),
 ('Oceania',),
 ('Europe',),
 ('Asia',),
 ('Europe',),
 ('Europe',),
 ('Central America',),
 ('South America',)]

In [25]:
%%sql
Select Region From Interpol WHERE 'National Fugitives' = 0

 * sqlite://
Done.

[]

In [10]:
%%sql
Select Country FROM Interpol WHERE 'National Fugitives' = 0 AND Region = 'Europe'

 * sqlite://
(sqlite3.OperationalError) no such table: Interpol
[SQL: Select Country FROM Interpol WHERE 'National Fugitives' = 0 AND Region = 'Europe']
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
# Challenge 1
# Using the Interpol Dataset, let us get the Northern African countries that  
# do not host possible fugitives or captured fugitives

In [23]:
%%sql 
Select Country FROM Interpol WHERE 'Possible Hosted Fugitives / Captured Fugitives' = 0 AND Region = 'Northern Africa'

 * sqlite://
Done.

[]

In [27]:
# Challenge 2
# Using the Interpol Dataset, let us get the countries without a National fugitive and a Wanted fugitive
#

%%sql 
Select Country FROM Interpol WHERE 'National Fugitive'  AND   'Wanted fugitive' = 0

 * sqlite://
Done.

[]

In [28]:
# Challenge 3
# Using the Interpol Dataset, which european countries have 3 National Fugitives
# 
%%sql
Select Country From Interpol Where 'National Fugitive'= 3 AND Region = 'Europe'

 * sqlite://
Done.

[]